import { IProduct } from '../../api/interfaces/product.interface';

export const mockProducts: IProduct[] = [
    {
        id: 1,
        img: 'https://avatars.mds.yandex.net/get-mpic/1603927/img_id2344831204735537444.jpeg/orig',
        description:
            'Угловой компьютерный стол Eureka L60 Gaming Desk c электрической регулировкой по высоте - идеальный выбор тех,' +
            ' кому необходимо расширенное пространство для работы. L60 имеет 60-дюймовую столешницу с гладким покрытием в стиле' +
            ' натуральной деревянной доски. На столе Eureka L60 можно с лёгкостью разместить несколько мониторов и необходимые девайсы' +
            ' для осуществления вашей деятельности. А такие решения по организации пространства, как надстройка для монитора и подставка' +
            ' под клавиатуру увеличат рабочее пространство минимум на 25%ю Стол регулируется по высоте и не вибрирует при подъёме/опускании,' +
            ' благодаря плавному пуску/остановке. Улучшенный многофункциональный контроллер с передней стороны стола имеет 2 USB порта и может' +
            ' хранить 4 предварительно запрограммированных высоты. А интеллектуальный датчик предотвращения столкновений Eureka был специально' +
            ' разработан для обеспечения безопасности объектов вокруг вашего стола при изменении высоты. Вам не надо волноваться о том, что ' +
            'стол столкнется с принтером или офисным шкафом, датчик защиты от столкновений не позволит столу ударить предметы вокруг стола.' +
            ' А благодаря специальной системе управления кабелями, на вашем столе никогда не будет запутанных проводов.',
        discount: 51,
        name: 'Стол для компьютера угловой (правый) c электрической регулировкой по высоте EUREKA ERK-L60R-RB',
        price: 113981,
    },
    {
        id: 2,
        img: 'https://avatars.mds.yandex.net/get-mpic/5332172/img_id2426743854176864377.png/orig',
        description:
            'Удобная сумка через плечо тренд этого лета и осени. Подходит для всех возрастов и полов. Высокое качество материала/ремня/молнии.' +
            ' Вместительная. Влаго и пыле отталкивающая ткань. ',
        discount: 50,
        name: 'Сумка клатч повседневная, текстиль, внутренний карман, зеленый',
        price: 1400,
    },
    {
        id: 3,
        img: 'https://avatars.mds.yandex.net/get-mpic/4949903/img_id3998596727300029979.jpeg/orig',
        description: 'NuPhy Air75 это инновационная сверхтонкая беспроводная механическая 75 клавиатура.',
        discount: 7,
        name: 'Беспроводная клавиатура Nuphy ультратонкая, AIR75 (Twilight) RGB подсветка, Brown Switch',
        price: 13490,
    },
    {
        id: 4,
        img: 'https://avatars.mds.yandex.net/get-mpic/5232221/2a0000018a8536a6ccb1de0d5b4b8f589510/orig',
        description:
            'Летите к звёздам с беспроводным контроллером Xbox – Starfield Limited Edition, незаменимым навигационным элементом ' +
            'в коллекции каждого исследователя – с прозрачными триггерами, полноценными боковыми и задними ручками и многим другим. Играйте ' +
            'на консоли и ПК. ',
        discount: 19,
        name: 'Геймпад Xbox wireless controller Starfield Limited edition',
        price: 14990,
    },
    {
        id: 5,
        img: 'https://avatars.mds.yandex.net/get-mpic/5284145/img_id8961138913959762032.jpeg/orig',
        description: 'MacBook Pro. Суперсила профессионалов.',
        discount: 0,
        name:
            '14.2" Ноутбук Apple Macbook Pro 14 Late 2021 3024×1964, Apple M1 Pro 3.2 ГГц, RAM 16 ГБ, ' +
            'SSD 512 ГБ, Apple graphics 14-core, macOS, MKGP3ZE/A, серый космос, английская раскладка',
        price: 210000,
    },
    {
        id: 6,
        img: 'https://avatars.mds.yandex.net/get-mpic/5347553/img_id2788428306450461284.jpeg/orig',
        description: 'В седьмую книгу манги вошёл двенадцатый том «Птица и война», что соответствует главам 98–103.',
        discount: 0,
        name: 'Манга Человек-бензопила. Кн. 7 Птица и война',
        price: 529,
    },
    {
        id: 7,
        img: 'https://avatars.mds.yandex.net/get-mpic/1862701/img_id7303248532742504349.jpeg/orig',
        description:
            'Мягкая игрушка Кот Акула - милый котенок в костюме акулы одна из самых популярных игрушек от японской художницы Mofusand.',
        discount: 44,
        name: 'Мягкая игрушка милый кавайный Кот- акула 30 см',
        price: 1200,
    },
    {
        id: 8,
        img: 'https://avatars.mds.yandex.net/get-mpic/5363183/img_id5132759521978528421.jpeg/orig',
        description:
            'Новый геймпад выполнен с оглядкой на Pro Controller Wii U в узнаваемым многими геймерами стиле, привычном форм-факторе и' +
            ' со стандартным для Nintendo расположением кнопок и стиков. ',
        discount: 2,
        name: 'Nintendo Switch Pro Контроллер - The Legend of Zelda: Tears of the Kingdom Edition',
        price: 10980,
    },
];
